#+TITLE: 572 project

1. prepare json files (already in data.tar.gz)
2. download project
   - run extract-repo-url.py, it will generate repo.txt and star.txt
   - run download.sh against repo.txt
3. run ground-all.sh against the folder containing project zip
   files. This will output ground raw output file.
4. run parse-ground.py against the raw ground output file will output
   csv data file.


Result table


SVM with radial

| Number of discretize category | linear | polynomial | radial basis | sigmoid |
|-------------------------------+--------+------------+--------------+---------|
|                             2 |        |            |              |         |
|                             3 |        |            |              |         |
|                             4 |        |            |              |         |
|                             5 |        |            |              |         |
|                             6 |        |            |              |         |
|                             7 |        |            |              |         |
|                             8 |        |            |              |         |
|                             9 |        |            |              |         |
|                            10 |        |            |              |         |

| cate | C | java | javascript |
|------+---+------+------------|
|    2 |   |      |            |
|    3 |   |      |            |
|    4 |   |      |            |




| star range | precision |
|------------+-----------|
|       <500 |           |
|   500-1000 |           |
|  1000-1500 |           |
|  1500-2000 |           |
|      >2000 |           |


| fold validation | precision |
|-----------------+-----------|
|               3 |           |
|               5 |           |
|               7 |           |
|              10 |           |


| model              | precision |
|--------------------+-----------|
| lm                 |           |
| SVM + linear       |           |
| SVM + polynormial  |           |
| SVM + radial basis |           |
| SVM + sigmoid      |           |
| Decision Tree      |           |

| language   | precision |
|------------+-----------|
| C          |           |
| java       |           |
| javascript |           |
| shell      |           |
| ruby       |           |



* Tables

| category | accuracy |
|----------+----------|
|        2 |     0.83 |
|        3 |     0.71 |
|        4 |     0.61 |
|        5 |     0.54 |
|        6 |     0.47 |
|        7 |     0.42 |
|        8 |     0.38 |
|        9 |     0.35 |
|       10 |     0.32 |
#+TBLFM: $2=(round $2)%

| category | c.csv | php.csv | java.csv | javascript.csv | shell.csv | ruby.csv | python.csv |
|----------+-------+---------+----------+----------------+-----------+----------+------------|
|        2 |  0.92 |    0.93 |     0.84 |           0.56 |      0.95 |     0.88 |       0.83 |
|        3 |  0.85 |    0.87 |      0.7 |           0.39 |      0.92 |     0.78 |       0.74 |
|        4 |  0.79 |    0.82 |     0.61 |           0.31 |      0.87 |     0.69 |       0.63 |
|        5 |  0.76 |    0.76 |     0.52 |           0.22 |      0.82 |     0.63 |       0.56 |
|        6 |  0.72 |    0.71 |     0.47 |           0.17 |       0.8 |     0.58 |       0.51 |
|        7 |  0.67 |    0.67 |     0.42 |           0.15 |      0.77 |     0.53 |       0.46 |
|        8 |  0.63 |    0.63 |     0.36 |           0.15 |      0.74 |     0.49 |       0.42 |
|        9 |   0.6 |    0.59 |     0.33 |           0.11 |      0.71 |     0.46 |       0.39 |
|       10 |  0.57 |    0.57 |      0.3 |            0.1 |      0.69 |     0.44 |       0.35 |
#+TBLFM: $2=(round $2)%
#+TBLFM: $3=(round $3)%
#+TBLFM: $4=(round $4)%
#+TBLFM: $5=(round $5)%
#+TBLFM: $6=(round $6)%
#+TBLFM: $7=(round $7)%
#+TBLFM: $8=(round $8)%

| category | linear | polynomial | radial | sigmoid |
|----------+--------+------------+--------+---------|
|        2 |   0.82 |       0.82 |   0.83 |     0.8 |
|        3 |   0.71 |       0.69 |   0.71 |    0.67 |
|        4 |   0.61 |       0.58 |   0.61 |    0.58 |
|        5 |   0.54 |       0.49 |   0.54 |     0.5 |
|        6 |   0.47 |       0.43 |   0.47 |    0.45 |
|        7 |   0.42 |       0.36 |   0.43 |     0.4 |
|        8 |   0.38 |       0.33 |   0.38 |    0.36 |
|        9 |   0.35 |       0.29 |   0.35 |    0.33 |
|       10 |   0.32 |       0.26 |   0.32 |    0.29 |
#+TBLFM: $2=(round $2)%
#+TBLFM: $3=(round $3)%
#+TBLFM: $4=(round $4)%
#+TBLFM: $5=(round $5)%
#+TBLFM: $6=(round $6)%
